Repository: nikitalitoshik/Add-Food-Nutrition-Helper
Catalog: *_nutrition_app/locale/*/LC_MESSAGES/django.po
Languages: lv

source: Male
lv: Vīrietis

source: Female
lv: Sieviete

source: Sedentary (low activity)
lv: Mazkustīgs (zema aktivitāte)

source: Light activity
lv: Viegla aktivitāte

source: Moderate activity
lv: Vidēja aktivitāte

source: High activity
lv: Augsta aktivitāte

source: Very active
lv: Ļoti aktīvs

source: Lose weight
lv: Samazināt svaru

source: Maintain weight
lv: Uzturēt svaru

source: Gain weight
lv: Palielināt svaru

source: Profile: %(user)s
lv: Profils: %(user)s

source: Calculator — Nutrition Helper
lv: Profils — Uztura palīgs

source: Calorie & Macro Calculator
lv: Kaloriju un makro aprēķins

source: Enter your personal data to get personalized calorie and macro recommendations.
lv: Ievadiet savus personiskos datus, lai saņemtu personalizētas kaloriju un makro rekomendācijas.

source: Age
lv: Vecums

source: Sex
lv: Dzimums

source: Weight (kg)
lv: Svars (kg)

source: Height (cm)
lv: Augums (cm)

source: Activity level
lv: Aktivitātes līmenis

source: Sedentary
lv: Mazkustīgs

source: Light
lv: Viegla aktivitāte

source: Moderate
lv: Vidēja aktivitāte

source: Active
lv: Aktīvs

source: Goal
lv: Mērķis

source: Results
lv: Rezultāti

source: Recommended
lv: Ieteicamās kalorijas

source: Approx macro distribution
lv: Paredzētais makro sadalījums

source: Protein
lv: Olbaltumvielas

source: Fat
lv: Tauki

source: Carbs
lv: Ogļhidrāti

source: Add Food — Nutrition Helper
lv: Pievienot ēdienu — Uztura palīgs

source: Add food
lv: Pievienot ēdienu

source: Product name
lv: Produkts

source: e.g. Homemade granola
lv: piem., mājās gatavota granola

source: Calories (per 100g)
lv: Kalorijas (uz 100 g)

source: Protein (g/100g)
lv: Olbaltumvielas

source: Fat (g/100g)
lv: Tauki (g/100 g)

source: Carbs (g/100g)
lv: Ogļhidrāti (g/100 g)

source: Amount (grams)
lv: Daudzums (gramos)

source: Add custom product
lv: Pievienot pielāgotu produktu

source: Clear
lv: Notīrīt

source: Eaten today
lv: Šodienas ieraksti

source: Today totals
lv: Šodien (summa)

source: Calories
lv: Kalorijas

source: Progress
lv: Progres

source: Entries today
lv: Šodienas ieraksti

source: Edit entry
lv: Rediģēt ierakstu

source: Edit
lv: Rediģēt

source: Delete entry
lv: Dzēst ierakstu

source: Delete
lv: Dzēst

source: Amount (g)
lv: Daudzums (gramos)

source: Save
lv: Saglabāt

source: Cancel
lv: Atcelt

source: No entries
lv: Nav ierakstu

source: Search product (external database)
lv: Meklēt produktu (ārējā datubāzē)

source: Search products
lv: Meklēt produktus

source: Search products (e.g. banana, milk)
lv: Meklēt produktus (piem., banāns, piens)

source: Search
lv: Meklēt

source: Barcode
lv: Svītrkods

source: Enter UPC / Barcode (e.g. 012345678905)
lv: Ievadiet UPC/svītrkodu (piem., 012345678905)

source: Lookup by barcode
lv: Meklēt pēc svītrkoda

source: Or search by name using the field above.
lv: Vai meklējiet pēc nosaukuma, izmantojot laukumu augstāk.

source: Home
lv: Sākums

source: Change language
lv: Mainīt valodu

source: Language
lv: Valoda

source: Account
lv: Konts

source: Logout
lv: Iziet

source: Login / Sign up
lv: Pieteikties / Reģistrēties

source: Profile — Nutrition Helper
lv: Profils — Uztura palīgs

source: User profile
lv: Lietotāja profils

source: User
lv: Lietotājs

source: Edit Profile
lv: Rediģēt profilu

source: Save profile
lv: Saglabāt profilu

source: Calculation results
lv: Aprēķina rezultāti

source: These recommendations are calculated based on your personal profile data and selected goal.
lv: Šīs rekomendācijas tiek aprēķinātas, pamatojoties uz jūsu profila datiem un izvēlēto mērķi.

source: Fill in your profile information above to see personalized calorie and macro recommendations.
lv: Aizpildiet profila informāciju augstāk, lai redzētu personalizētas kaloriju un makro rekomendācijas.

source: Back to home
lv: Atpakaļ uz sākumlapu

source: Progress — Nutrition Helper
lv: Profils — Uztura palīgs

source: Progress & Goals
lv: Progres un mērķi

source: Calories per day (last 14 days)
lv: Kalorijas dienā (pēdējās 14 dienas)

source: Track your daily calorie intake to monitor your progress towards your goals.
lv: Izsekojiet savu dienas kaloriju patēriņu, lai kontrolētu progresu mērķu sasniegšanā.

source: Login — Nutrition Helper
lv: Profils — Uztura palīgs

source: Login
lv: Pieteikties

source: Username
lv: Lietotājs

source: Password
lv: Parole

source: Don't have an account?
lv: Nav konta?

source: Sign up here
lv: Reģistrējieties šeit

source: Sign Up — Nutrition Helper
lv: Profils — Uztura palīgs

source: Sign Up
lv: Reģistrēties

source: Create account
lv: Izveidot kontu

source: Already have an account?
lv: Jau ir konts?

source: Log in
lv: Pieteikties

source: Account created. You can now log in.
lv: Konts izveidots. Tagad varat pieteikties.
