Repository: nikitalitoshik/Add-Food-Nutrition-Helper
Catalog: *_nutrition_app/locale/*/LC_MESSAGES/djangojs.po
Languages: lv, ru

source: Enter product name
lv: Ievadiet produkta nosaukumu
ru: Введите название продукта

source: Enter valid amount
lv: Ievadiet derīgu daudzumu
ru: Введите корректное количество

source: All nutrient fields are zero. Continue?
lv: Visi uzturvielu lauki ir nulles. Turpināt?
ru: Все поля макроэлементов равны нулю. Продолжить?

source: Please log in to save entries.
lv: Lūdzu, piesakieties, lai saglabātu ierakstus.
ru: Пожалуйста, войдите, чтобы сохранить записи.

source: Add failed
lv: Pievienošana neizdevās
ru: Не удалось добавить

source: Add failed (server)
lv: Pievienošana neizdevās (serveris)
ru: Ошибка добавления (сервер)

source: Network error, try again.
lv: Tīkla kļūda, mēģiniet vēlreiz.
ru: Ошибка сети, попробуйте снова.

source: Searching...
lv: Meklē...
ru: Поиск...

source: No results.
lv: Rezultātu nav.
ru: Результатов нет.

source: External database error. Try again or add product manually.
lv: Kļūda ārējā datubāzē. Mēģiniet vēlreiz vai pievienojiet produktu manuāli.
ru: Ошибка внешней базы данных. Попробуйте снова или добавьте продукт вручную.

source: unnamed
lv: nenosaukts
ru: без названия

source: Calories
lv: Kalorijas
ru: Калории

source: Protein
lv: Olbaltumvielas
ru: Белки

source: Fat
lv: Tauki
ru: Жиры

source: Carbs
lv: Ogļhidrāti
ru: Углеводы

source: Enter a positive amount (grams)
lv: Ievadiet pozitīvu daudzumu (gramos)
ru: Введите положительное количество (в граммах)

source: Looking up barcode...
lv: Meklē pēc svītrkoda...
ru: Поиск по штрихкоду...

source: Product not found for this barcode.
lv: Produktu pēc šī svītrkoda nav atrasts.
ru: Продукт не найден по этому штрихкоду.

source: Lookup failed, try again.
lv: Meklēšana neizdevās, mēģiniet vēlreiz.
ru: Поиск не удался, попробуйте снова.

source: Are you sure you want to delete this entry?
lv: Vai tiešām vēlaties dzēst šo ierakstu?
ru: Вы уверены, что хотите удалить эту запись?

source: Delete failed
lv: Dzēšana neizdevās
ru: Удаление не удалось

source: Delete failed (server)
lv: Dzēšana neizdevās (serveris)
ru: Удаление не удалось (сервер)

source: Edit failed
lv: Rediģēšana neizdevās
ru: Редактирование не удалось
